
[A115DroidProtocol X2AbilityTemplate]
LocFriendlyName=“突击队机器人协议”
LocLongDescription=“BX突击队机器人是经过实战考验的渗透和战斗单位，对于抵抗银河帝国很有用。对火灾、毒药和精神影响具有免疫力。
LocHelpText=“BX突击队机器人是经过实战考验的渗透和战斗单位，对于抵抗银河帝国很有用。对火灾、毒药和精神影响具有免疫力。
LocFlyOverText=“猎人杀手协议”
LocPromotionPopupText=“突击队机器人协议”
;-----------------------
; TECHS
;-----------------------
[DroidCommandos X2TechTemplate]
DisplayName=“机器人突击队”
Summary=“凭借我们在机器人制造方面的最新经验，我们可以尝试制造自己的 BX 单元.然而，它们很笨。

[BuildBX X2TechTemplate]
DisplayName="BX Unit"
Summary=BX单位最初是为了帮助以太集合体而设计的，它们在游击战中非常有效，可以花费数天甚至数周的时间暗杀或捕获指定目标。它们也可以成为有效的前线作战单位，适应几乎任何情况."

;ENCYCLOPEDIA AND BIOGRAPHIES


[BXRookie X2SoldierClassTemplate]
DisplayName="BX单位新兵"

[BXSoldier X2CharacterTemplate]
strCharacterName="士兵"

strCharacterBackgroundMale[0]="这台BX系列部队已准备好为抵抗军服务，为变种人部队配备了最好的暗杀和俘虏协议."

[RM_BX X2EncyclopediaTemplate]
ListTitle="BX Droids"
DescriptionTitle="BX突击队机器人"
DescriptionEntry="BX指挥机器人部队是由一个控制在STG（暗中操作的组织）下的空壳公司设计的，他们以最终加入Ethereals的服役为掩饰。实际上，这些机器人被装备了反抗编程，并被释放到银河系中，隐藏的工厂确保他们将成为Ethereals的不断困扰，并为我们提供一些支援。作为Ethereal Collective的新兵，你将成为BX指挥机器人部队的一员。我们的目标是与Ethereals作战，并为我们的势力提供背后的支持."


;Data

[XGCharacterGenerator_BX]
BXFirstName="BX"
BXLastNamePrefix="Model #"

[UICustomize_BXHead]
m_strHead=Heads

[UICustomize_BXMenu]
m_strHead=Heads


;CONTENT


[K_InvisibleHeadDroid X2BodyPartTemplate]
DisplayName="Invisible Head Droid"

[A115BXDroidHead X2BodyPartTemplate]
DisplayName="BX Commando Droid Head"

[A115BXDroidCaptainHead X2BodyPartTemplate]
DisplayName="BX Commando Droid Captain Head"

[A115BXDroidDiplomatHead X2BodyPartTemplate]
DisplayName="BX Commando Droid Diplomat Head"

[A115BXDroidCitadelHead X2BodyPartTemplate]
DisplayName="BX Commando Droid Citadel Head"

[A115BXDroidTrainingHead X2BodyPartTemplate]
DisplayName="BX Commando Droid Training Head"

[Exclusive_TORHK X2BodyPartTemplate]
DisplayName="<img src='img:///SWHK47VPPkg.icon_revan' width='26' height='26' vspace='-4'>HK-47"